<?php
$cityRus = array (
    "Московская область" => ['Реутов','Мытищи','Королев','Видное','Раменское','Фрязино'],
    "Ленинградская область" => ['Колпино','Пушкин','Павловск','Коммунар','Сертолово','Колтуши'],
    "Ростовская область" => ['Батайск','Зерноград','Новочеркасск','Шахты','Азов'],
    "Краснодарский край" => ['Кропоткин','Кущевка','Усть-Лабинск','Тбилисская','Майкоп'],
     );
 
 
 
foreach ($cityRus as $oblast => $city){
        foreach ($city as $key => $value){
                if (mb_substr($value, 0, 1) == "К")
                                echo $value . "<br/>";
        }
}


?>